bank_system_app/app/views/banks/index.html.erb

            <td>$<%= number_with_precision(bank.total_deposits, precision: 2) %></td>
            <td><%= bank.savings_accounts.count %></td>
---
SELECT COUNT(*) FROM "accounts" WHERE "accounts"."bank_id" = ?  [["bank_id", 1]]