bank_system_app/app/views/banks/show.html.erb

SELECT COUNT(*) FROM "accounts" WHERE "accounts"."bank_id" = ?  [["bank_id", 1]]
---
      <h4>Savings Accounts</h4>
      <p style="font-size: 2em; margin: 0; color: #3498db;"><%= @bank.savings_accounts.count %></p>