bank_system_app/app/controllers/accounts_controller.rb

INSERT INTO "accounts" ("account_number", "account_holder", "balance", "account_type", "bank_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?) RETURNING "id"
---
  def create
    @account = @bank.accounts.build(account_params)

    if @account.save

SELECT "banks".* FROM "banks" WHERE "banks"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def set_bank
    @bank = Bank.find(params[:bank_id])

SELECT "accounts".* FROM "accounts" WHERE "accounts"."bank_id" = ? AND "accounts"."id" = ? LIMIT ?  [["bank_id", 1], ["id", 1], ["LIMIT", 1]]
---
  def set_account
    @account = @bank.accounts.find(params[:id])