bank_system_app/app/controllers/banks_controller.rb

  def index
    @banks = Bank.all
---
SELECT "banks".* FROM "banks"

  def show
    @accounts = @bank.accounts.includes(:transactions)
---
SELECT COUNT(*) FROM "accounts" WHERE "accounts"."bank_id" = ?  [["bank_id", 1]]

  def create
    @bank = Bank.new(bank_params)

    if @bank.save
---
INSERT INTO "banks" ("name", "created_at", "updated_at") VALUES (?, ?, ?) RETURNING "id"  [["name", "Bank of Baroda"], ["created_at", "2025-09-22 04:24:49.470657"], ["updated_at", "2025-09-22 04:24:49.470657"]]

  def set_bank
    @bank = Bank.find(params[:id])
---
SELECT "banks".* FROM "banks" WHERE "banks"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]