bank_system_app/app/controllers/transactions_controller.rb

SELECT "transactions".* FROM "transactions" ORDER BY "transactions"."created_at" DESC LIMIT ?  [["LIMIT", 50]]
---
  def index
    @transactions = Transaction.includes(:account).recent.limit(50)