bank_system_app/app/models/account.rb

INSERT INTO "transactions" ("transaction_type", "amount", "description", "account_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?) RETURNING "id"
---
  def deposit(amount)
    return false if amount <= 0

    self.balance += amount
    if save
      transactions.create!(
        transaction_type: 'deposit',
        amount: amount,
        description: "Deposit of $#{amount}"
      )

INSERT INTO "transactions" ("transaction_type", "amount", "description", "account_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?) RETURNING "id"
---
  def withdraw(amount)
    return false if amount <= 0

    case account_type
    when 'savings'
      return false if balance - amount < 100 # Minimum balance requirement
    when 'checking'
      return false if balance - amount < -500 # Overdraft limit
    end

    self.balance -= amount
    if save
      transactions.create!(
        transaction_type: 'withdrawal',
        amount: amount,
        description: "Withdrawal of $#{amount}"
      )

INSERT INTO "transactions" ("transaction_type", "amount", "description", "account_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?) RETURNING "id"
---
  def add_interest(rate = 0.02)
    return false unless account_type == 'savings'

    interest = balance * rate
    self.balance += interest
    if save
      transactions.create!(
        transaction_type: 'interest',
        amount: interest,
        description: "Interest added: $#{interest.round(2)}"
      )